v001-stationary/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    
    (0  0  0)           // 0: Inlet
    (20 0  0)           // 1: Outlet

    (0  0.09990 -0.00436)  // 2: Inlet_wedge1 (-2.5 deg)
    (0  0.09990  0.00436)  // 3: Inlet_wedge2 (+2.5 deg)
    (20 0.09990 -0.00436)  // 4: Outlet_wedge1 (-2.5 deg)
    (20 0.09990  0.00436)  // 5: Outlet_wedge2 (+2.5 deg)

    (0  3.09705 -0.13522)  // 6: Inlet_ro_wedge1
    (0  3.09705  0.13522)  // 7: Inlet_ro_wedge2
    (20 3.09705 -0.13522)  // 8: Outlet_ro_wedge1
    (20 3.09705  0.13522)  // 9: Outlet_ro_wedge2
);

blocks
(

    hex (0 2 3 0 1 4 5 1) water (15 1 400) simpleGrading (1 1 1)

    hex (2 6 7 3 4 8 9 5) rock (40 1 400) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    water_inlet
    {
        type patch;
        faces ( (0 3 2 0) );
    }
    rock_inlet
    {
        type patch;
        faces ( (2 3 7 6) );
    }
    water_outlet
    {
        type patch;
        faces ( (1 4 5 1) );
    }
    rock_outlet
    {
        type patch;
        faces ( (4 8 9 5) );
    }
    rock_outer
    {
        type patch;
        faces ( (6 7 9 8) );
    }
    water_wedge1
    {
        type wedge;
        faces
        (
            (0 2 4 1)
        );
    }
    water_wedge2
    {
        type wedge;
        faces
        (
            (0 1 5 3)
        );
    }
    rock_wedge1
    {
        type wedge;
        faces
        (
            (2 6 8 4)
        );
    }
    rock_wedge2
    {
        type wedge;
        faces
        (
            (3 5 9 7)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 1 1 0)
        );
    }
);
 
mergePatchPairs
(
);


// ************************************************************************* //
