v001-stationary/constant/regionProperties
FoamFile { version 2.0; format ascii; class dictionary; object regionProperties; }
regions ( fluid (water) solid (rock) );
