v001-stationary/system/water/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         GaussSeidel;
    }

    "(U|h|k|epsilon|R)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0.1;
    }
}

SIMPLE
{
    momentumPredictor   yes;
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        p_rgh           1e-4;
        //U               1e-5;
        h               1e-5;
        k               1e-5;
        epsilon         1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p_rgh           0.3;
        rho             1.0;
    }
    equations
    {
        U               0.7;
        "h.*"           0.7;
        k               0.7;
        epsilon         0.7;
    }
}

// ************************************************************************* //