v001-stationary/system/rock/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile 
{ 
    version 2.0; 
    format ascii; 
    class dictionary; 
    object changeDictionaryDict; 
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

T
{
    internalField   uniform 279.15;
    boundaryField
    {
        ".*" { type zeroGradient; }
        rock_inlet { type externalWallHeatFluxTemperature; mode coefficient; Ta uniform 283.15; h uniform 10; kappaMethod solidThermo; value uniform 279.15; }
        rock_outer { type externalWallHeatFluxTemperature; mode coefficient; Ta uniform 279.15; h uniform 0.2; kappaMethod solidThermo; value uniform 279.15; }
        rock_outlet { type externalWallHeatFluxTemperature; mode coefficient; Ta uniform 279.15; h uniform 0.2; kappaMethod solidThermo; value uniform 279.15; }
        rock_to_water { type compressible::turbulentTemperatureRadCoupledMixed; Tnbr T; kappaMethod solidThermo; value uniform 279.15; }
        
        "(rock_wedge1|rock_wedge2)" { type wedge; }
    }
}

p
{
    internalField   uniform 1e5;
    boundaryField
    {
        ".*" { type calculated; value uniform 1e5; }
        
        "(rock_wedge1|rock_wedge2)" { type wedge; }
    }
}

// ************************************************************************* //